{
  "motorcycle_make": "Kymco",
  "motorcycle_model": "Agility 125",
  "title": "Electrical Issues",
  "description": "Diagnose electrical problems on the Kymco Agility 125 including lights, starter, charging system, and fuses.",
  "category": "electrical",
  "difficulty": "intermediate",
  "tree_data": {
    "nodes": [
      {
        "id": "start",
        "type": "question",
        "text": "What electrical issue are you experiencing on your Agility 125?",
        "safety": "green",
        "options": [
          { "text": "Headlight, tail light, or indicators not working", "next": "check_bulbs" },
          { "text": "Battery keeps dying or will not hold a charge", "next": "check_charging_voltage" },
          { "text": "Electrical components work intermittently", "next": "check_connectors" },
          { "text": "No electrical power at all — completely dead", "next": "check_battery_connections" }
        ]
      },
      {
        "id": "check_bulbs",
        "type": "check",
        "text": "Check bulbs and fuses for the affected circuit",
        "safety": "green",
        "instructions": "Start with the simplest checks. For a non-working light on the Agility 125: (1) Check the bulb — remove it and inspect the filament. A broken filament means the bulb is blown, (2) Check the fuse for that circuit — the fuse box is typically under the seat near the battery. Common fuses: headlight (10A), tail/signal (10A), ignition (10A), main (15-20A). Replace any blown bulb or fuse with the correct rating.",
        "next": "bulb_result"
      },
      {
        "id": "bulb_result",
        "type": "question",
        "text": "Did replacing the bulb or fuse fix the issue?",
        "safety": "green",
        "options": [
          { "text": "Yes — light works now", "next": "solution_bulb_replaced" },
          { "text": "No — new bulb still does not work", "next": "check_switch" },
          { "text": "Fuse blows again immediately", "next": "solution_short_circuit" }
        ]
      },
      {
        "id": "check_switch",
        "type": "check",
        "text": "Check the related switch and wiring",
        "safety": "yellow",
        "warning": "Disconnect the battery before probing electrical connectors to avoid short circuits.",
        "instructions": "If the bulb and fuse are good, the switch or wiring is likely at fault. For the Agility 125: (1) Headlight: check the dimmer switch on the left handlebar — toggle between high and low beam, (2) Indicators: check the turn signal switch — it may have corroded contacts, (3) Use a multimeter to check for 12V at the bulb socket with the switch turned on. If there is no voltage at the socket, the problem is between the fuse box and the bulb — check connectors and wiring along the path.",
        "next": "switch_result"
      },
      {
        "id": "switch_result",
        "type": "question",
        "text": "What did you find?",
        "safety": "green",
        "options": [
          { "text": "Switch does not pass voltage — switch is faulty", "next": "solution_replace_switch" },
          { "text": "Voltage present at socket but bulb does not light", "next": "solution_ground_issue" },
          { "text": "No voltage at socket — wiring problem", "next": "solution_wiring_repair" }
        ]
      },
      {
        "id": "check_charging_voltage",
        "type": "check",
        "text": "Check the charging system output",
        "safety": "yellow",
        "warning": "Keep hands and tools away from the cooling fan and moving parts while the engine is running.",
        "instructions": "With the engine running at approximately 3,000-4,000 RPM, measure the voltage across the battery terminals using a multimeter set to DC volts. A healthy charging system on the Agility 125 should read 13.5V-14.8V. Below 13.0V means the battery is not being charged. Above 15.0V means the regulator/rectifier is overcharging, which will boil the battery and damage electrical components.",
        "next": "charging_result"
      },
      {
        "id": "charging_result",
        "type": "question",
        "text": "What is the charging voltage with the engine running?",
        "safety": "green",
        "options": [
          { "text": "Below 13.0V — not charging", "next": "check_stator" },
          { "text": "13.5V-14.8V — charging normally", "next": "solution_battery_drain" },
          { "text": "Above 15.0V — overcharging", "next": "solution_replace_regulator" }
        ]
      },
      {
        "id": "check_stator",
        "type": "check",
        "text": "Check the stator output",
        "safety": "yellow",
        "warning": "The stator produces AC voltage. Do not touch the stator wires while the engine is running.",
        "instructions": "The charging system on the Agility 125 consists of a stator (generator) inside the magneto cover, and a regulator/rectifier that converts AC to DC. To determine which has failed: Disconnect the stator connector (usually a white multi-pin connector coming from the engine). Set your multimeter to AC volts. With the engine running at 3,000 RPM, measure across the stator output wires. You should see 30-60V AC (varies by RPM). If you get 0V or very low voltage, the stator has failed. If you get proper AC voltage, the regulator/rectifier is the problem.",
        "next": "stator_result"
      },
      {
        "id": "stator_result",
        "type": "question",
        "text": "What is the stator AC output?",
        "safety": "green",
        "options": [
          { "text": "Low or no AC voltage — stator is bad", "next": "solution_replace_stator" },
          { "text": "Good AC voltage — regulator/rectifier is bad", "next": "solution_replace_regulator" }
        ]
      },
      {
        "id": "check_connectors",
        "type": "check",
        "text": "Inspect electrical connectors for corrosion",
        "safety": "green",
        "instructions": "Intermittent electrical problems are almost always caused by poor connections. On the Agility 125, check: (1) Battery terminals — clean and tight, (2) Main harness connectors under the seat and behind the headlight, (3) Handlebar switch connectors, (4) Ground wires — especially the engine ground and frame ground points. Look for green corrosion, loose pins, or water inside connectors. Scooter connectors are exposed to road spray and can corrode quickly. Unplug each connector, clean the pins with contact cleaner, apply dielectric grease, and reconnect firmly.",
        "next": "connector_result"
      },
      {
        "id": "connector_result",
        "type": "question",
        "text": "Did cleaning connectors resolve the intermittent issue?",
        "safety": "green",
        "options": [
          { "text": "Yes — problem is resolved", "next": "solution_connectors_cleaned" },
          { "text": "No — still intermittent", "next": "solution_harness_inspection" }
        ]
      },
      {
        "id": "check_battery_connections",
        "type": "check",
        "text": "Check battery connections and main fuse",
        "safety": "yellow",
        "warning": "A completely dead electrical system may indicate a major short. Proceed carefully when reconnecting power.",
        "instructions": "If the Agility 125 has absolutely no electrical power: (1) Check the battery terminals — a loose or corroded terminal will cut all power, (2) Check the main fuse (15-20A) near the battery, (3) Check that the battery has voltage — measure with a multimeter. If the battery shows 12V+ but nothing works, the main fuse or main wiring harness ground has failed. Trace the positive cable from the battery to the main fuse, and the negative cable from the battery to the frame ground point.",
        "next": "dead_result"
      },
      {
        "id": "dead_result",
        "type": "question",
        "text": "What did you find?",
        "safety": "green",
        "options": [
          { "text": "Battery terminal was loose or corroded", "next": "solution_clean_terminals" },
          { "text": "Main fuse is blown", "next": "solution_main_fuse" },
          { "text": "Battery has no voltage", "next": "solution_dead_battery" },
          { "text": "Battery and fuse are good but still no power", "next": "solution_ignition_switch" }
        ]
      },
      {
        "id": "solution_bulb_replaced",
        "type": "solution",
        "text": "Bulb or Fuse Replaced",
        "safety": "green",
        "action": "The blown bulb or fuse has been replaced and the light is working.",
        "details": "Keep spare bulbs and fuses in the under-seat storage. If bulbs blow frequently, check for voltage spikes from the regulator/rectifier (should not exceed 14.8V). If fuses blow frequently, there is likely a short circuit in that circuit that needs to be traced."
      },
      {
        "id": "solution_replace_switch",
        "type": "solution",
        "text": "Replace the Faulty Switch",
        "safety": "green",
        "action": "Replace the faulty handlebar switch assembly.",
        "details": "Handlebar switch clusters on the Agility 125 are available as complete assemblies (left or right side). The left switch typically controls the horn, turn signals, and high/low beam. The right switch controls the start button and kill switch. Water ingress and corrosion are common causes of switch failure on scooters. After replacing, apply dielectric grease to the connector."
      },
      {
        "id": "solution_ground_issue",
        "type": "solution",
        "text": "Fix the Ground Connection",
        "safety": "green",
        "action": "Clean and secure the ground wire for the affected light.",
        "details": "If voltage is present at the bulb socket but the bulb does not light, the ground (return) path is broken. Trace the ground wire from the light housing back to its frame or engine connection point. Clean the ground contact point down to bare metal, reconnect, and apply a thin layer of dielectric grease to prevent future corrosion."
      },
      {
        "id": "solution_wiring_repair",
        "type": "solution",
        "text": "Repair the Wiring",
        "safety": "yellow",
        "warning": "Use proper soldered connections with heat-shrink tubing. Do not rely on electrical tape alone for permanent repairs.",
        "action": "Locate and repair the damaged wiring between the fuse box and the light socket.",
        "details": "Trace the wiring from the fuse to the switch to the bulb socket. Look for cut, chafed, or corroded wires, especially where wiring passes through frame grommets or where bodywork panels can pinch wires. Scooters are prone to wiring damage from body panel removal and reinstallation. Repair with solder and heat-shrink tubing."
      },
      {
        "id": "solution_short_circuit",
        "type": "solution",
        "text": "Short Circuit in Lighting Circuit",
        "safety": "red",
        "warning": "A short circuit can cause wiring fires. Do not keep replacing fuses if they blow immediately. Professional diagnosis is recommended if you cannot locate the short.",
        "action": "Trace the wiring in the affected circuit to find and repair the short.",
        "details": "A fuse that blows immediately indicates a dead short (wire to ground contact). Disconnect all loads on that circuit one at a time and check if the fuse holds. When you find the component or section that causes the fuse to blow, inspect its wiring for bare wire touching the frame or other ground points. Common locations: where wires pass through headlight brackets, under the seat, and where the harness runs along the frame."
      },
      {
        "id": "solution_battery_drain",
        "type": "solution",
        "text": "Parasitic Battery Drain",
        "safety": "green",
        "action": "Check for a parasitic drain that is killing the battery when the scooter is parked.",
        "details": "If the charging system is working correctly but the battery still dies, something is drawing power when the ignition is off. With the ignition off, disconnect the negative battery cable and connect a multimeter (set to DC amps) in series between the cable and terminal. A normal parasitic draw is under 30mA. If the draw is higher, remove fuses one at a time until the draw drops — this identifies the circuit with the drain. Common culprits: aftermarket accessories, alarm systems, or a faulty regulator/rectifier."
      },
      {
        "id": "solution_replace_regulator",
        "type": "solution",
        "text": "Replace the Regulator/Rectifier",
        "safety": "yellow",
        "warning": "An overcharging system can boil the battery and damage electronics. Replace the regulator/rectifier promptly.",
        "action": "Replace the faulty regulator/rectifier unit.",
        "details": "The regulator/rectifier on the Agility 125 is typically mounted on the frame near the rear of the scooter for heat dissipation. It converts the stator AC output to regulated DC voltage. When it fails, it either stops charging (no output) or overcharges (excess voltage). Use an OEM or quality aftermarket replacement. Ensure the mounting surface is clean for proper heat transfer. After replacement, verify charging voltage is 13.5-14.8V."
      },
      {
        "id": "solution_replace_stator",
        "type": "solution",
        "text": "Replace the Stator",
        "safety": "yellow",
        "warning": "Stator replacement requires removing the magneto cover. Use a flywheel puller — do not pry the flywheel off.",
        "action": "Replace the faulty stator.",
        "details": "The stator is located inside the magneto (generator) cover on the left side of the engine. Replacement requires removing the CVT cover to access the magneto area, or the magneto cover itself depending on the layout. A flywheel (rotor) puller tool is needed to remove the flywheel to access the stator. This is an intermediate-level repair. If you are not comfortable with this, a shop can do it relatively inexpensively for a scooter."
      },
      {
        "id": "solution_connectors_cleaned",
        "type": "solution",
        "text": "Connectors Cleaned Successfully",
        "safety": "green",
        "action": "The corroded connectors have been cleaned and the intermittent problem is resolved.",
        "details": "Apply dielectric grease to all cleaned connectors to prevent future corrosion. Consider wrapping exposed connectors with self-amalgamating tape if the scooter is frequently exposed to rain or road spray. Check connectors again every 6 months as preventative maintenance."
      },
      {
        "id": "solution_harness_inspection",
        "type": "solution",
        "text": "Full Wiring Harness Inspection Needed",
        "safety": "yellow",
        "warning": "Wiring harness faults can be time-consuming to diagnose. Consider professional help if you are unable to locate the issue.",
        "action": "Systematically inspect the entire wiring harness for damage.",
        "details": "If cleaning connectors did not resolve intermittent issues, there is likely a chafed or broken wire in the harness that makes and breaks contact. Common damage points on the Agility 125: (1) where the harness passes from the body to the steering column (flexes with steering), (2) under body panels where clips may have pinched wires, (3) near the battery area where acid fumes can corrode wires. Wiggle sections of the harness while monitoring the affected circuit to locate the fault."
      },
      {
        "id": "solution_clean_terminals",
        "type": "solution",
        "text": "Battery Terminals Cleaned",
        "safety": "green",
        "action": "Clean the battery terminals and reconnect securely.",
        "details": "Remove the terminals, clean with a wire brush or sandpaper until shiny, and reconnect — negative terminal last. Apply a thin coat of dielectric grease or terminal protector to prevent future corrosion. Check terminal tightness periodically."
      },
      {
        "id": "solution_main_fuse",
        "type": "solution",
        "text": "Replace the Main Fuse",
        "safety": "yellow",
        "warning": "If the main fuse blows again immediately, do not keep replacing it. There is a major short circuit that must be found first.",
        "action": "Replace the main fuse with the correct amperage rating.",
        "details": "Replace with the exact same amperage fuse (typically 15A or 20A). If it blows again, there is a major short circuit — this requires systematic diagnosis by disconnecting circuits one at a time. Do not use a higher-rated fuse as this can cause a wiring fire."
      },
      {
        "id": "solution_dead_battery",
        "type": "solution",
        "text": "Battery is Completely Dead",
        "safety": "green",
        "action": "Replace the dead battery.",
        "details": "If the battery shows 0V or very low voltage and will not accept a charge, it has likely failed internally (shorted cell or sulfated plates). Replace with the correct battery type for the Agility 125 (typically YTX7A-BS or similar). Scooter batteries typically last 2-3 years. After installing the new battery, check the charging system to ensure it is working properly."
      },
      {
        "id": "solution_ignition_switch",
        "type": "solution",
        "text": "Ignition Switch or Main Wiring Fault",
        "safety": "yellow",
        "warning": "The ignition switch carries significant current. A faulty switch can overheat. Replace promptly.",
        "action": "Check and potentially replace the ignition switch.",
        "details": "If battery and fuses are good but nothing powers up, the ignition switch itself may have failed. Test by checking for 12V on the output side of the ignition switch when turned to ON. If no voltage passes through, the switch contacts are burned or corroded internally. Replacement ignition switches for the Agility 125 are available and include the lock cylinder. A locksmith or dealer can provide a keyed replacement."
      }
    ]
  }
}